/**
 * Получение элемента O(n)
 * Вставка в конец - O(1) (амортизированная вставка) или O(n)
 * Вставка в начало - O(n)
 * Удаление с начала / по индексу - O(n)
 * Удаление с конца - O(1)
 */

// Плотный (packed) массив - элементы одного типа, для них выделяется определенное кол-во байт на ячейку. Такие массивы быстрее.
const packedArr = [1, 10, 5, 9, 54];

// Разряженный (holey) массив - элементы разного типа, для них выделяется разное кол-во памяти. Работа сути с хеш-таблицей.
const holeyArr = [1, 'str', { x: 10, y: 4 }, ['JS', 'TS'], true];
