// ================ Recursion ==================

/**
 * В рекурсии нужно проверить две вещи — есть ли базовый случай и гарантированно ли каждый следующий вызов приближается к нему.
 *
 * Применение:
 * - Обход вложенных структур (деревья, графы)
 * - Решения задач типа "разделяй и властвуй"
 * - Алгоритмы поиска
 * - Обратного построения данных (разбор выражений, обработка DOM)
 *
 * Минусы:
 * - Возможно переполнение стека вызовов
 * - Циклы работают быстрее
 * - Сложный дебаг
 */

// ================= Factorial, time and space O(n) ====================
const factorial = (n: number): number => {
  // 0! = 1
  // n! = n * (n - 1)!, например 2! = 1 * 2 = 2, 4! = 1 * 2 * 3 * 4 = 24

  if (!Number.isInteger(n) || n < 0) {
    throw new Error('n must be a non-negative integer');
  }

  // Базовый случай (условие выхода)
  if (n === 0) {
    return 1;
  }

  // Рекурсивный случай (вызов себя же с другим аргументом)
  return n * factorial(n - 1);

  /**
   * Каждый рекурсивный вызов factorial() добавляется в call stack.
   *
   * factorial(5) ждёт factorial(4)
   * factorial(4) ждёт factorial(3)
   * factorial(3) ждёт factorial(2)
   * factorial(2) ждёт factorial(1)
   * factorial(1) ждёт factorial(0)
   *
   * factorial(0) достигает базового случая и возвращает 1.
   *
   * После этого стек начинает раскручиваться:
   *
   * factorial(1) = 1 * 1   = 1
   * factorial(2) = 2 * 1   = 2
   * factorial(3) = 3 * 2   = 6
   * factorial(4) = 4 * 6   = 24
   * factorial(5) = 5 * 24  = 120
   */
};

// ====================== Fibonacci time - O(2^n), memory - O(n) ==========================
// fibonacci(8): 1, 1, 2, 3, 5, 8, 13, 21

const fibonacci = (n: number): number => {
  if (n <= 1) {
    return n;
  }
  return fibonacci(n - 1) + fibonacci(n - 2);

  /**
 * Создается лерево рекурсии из левой и правой части, что-то типа такого:
 * const left = fibonachi(n - 1); 
 * const right = fibonachi(n - 2);
 * 
 * А в стек вначале кладется и вычисляется левая часть, затем правая

 * return left + right;
*/
};
