// ==================== DEQUE - объединение очереди и стека ====================
/**
 * Добавление / удаление элементов происходит только в начали или конец списка.
 * Вставки в середину нет.
 */

// ---------------- Задачи ----------------

// Вытащить из стека результаты
function flatten(...stack: any[]) {
  const result: any[] = [];

  while (stack.length) {
    const el = stack.shift(); // удаляю елемент из начала списка и записываю его в переменную

    if (Array.isArray(el)) {
      stack.unshift(...el); // если el - это массив, то разворачиваю его и записываю в начало списка
      continue; // начинаю обход заново
    }

    result.push(el);
  }

  return result;
}

console.log(flatten(1, [2, [[3]]], 4, 5, [6, [7]]));
console.log(flatten('a', ['b', 2], 3, null, [[4], ['c']]));
