/**
 * Применение:
 * - Обход вложенных структур (деревья, графы)
 * - Решения задач типа "разделяй и властвуй"
 * - Алгоритмы поиска
 * - Обратного построения данных (разбор выражений, обработка DOM)
 *
 * Минусы:
 * - Возможно переполнение стека вызовов
 * - Циклы работают быстрее
 * - Сложный дебаг
 */

export const factorial = (n) => {
  // Базовый случай (условие выхода)
  if (n === 1) {
    return 1;
  }

  // Рекурсивный случай (вызов себя же с другим аргументом)
  return n * factorial(n - 1);
};

// ======== Fibonachi - 1, 1, 2, 3, 5, 8, 13, 21 =========
export const fibonachi = (n) => {
  if (n === 1 || n === 2) {
    return 1;
  }
  return fibonachi(n - 1) + fibonachi(n - 2);
};
